In [10]:
import pandas as pd
import numpy as np

In [11]:
# what r vectorized oprations
# operation u apply work on every item of vector
a=np.array([1,2,3,4])
a*4

array([ 4,  8, 12, 16])

In [12]:
#problem in vectorized operations in python
# many operation of python not work on vector
#



s=['cat','dog',None,'rat']
for i in s:
        if i is not None and i.startswith('c'):
            print(True)
        else:
            print(False)    
# not detect none
# not optimize for large dataset as each item check

True
False
False
False

In [14]:
s=['cat','dog',None,'rat']
[i.startswith('c') for i in s]

AttributeError: 'NoneType' object has no attribute 'startswith'

In [15]:
#how pandas solve this issue/
s=pd.Series(['cat','dog',None,'rat'])
#string accessor
s.str.startswith('c')

#fast and optimized 
# it also detect none

0     True
1    False
2     None
3    False
dtype: object

In [16]:
#IMPORT titanic
df=pd.read_csv(r'C:\Users\HP\Desktop\all folder\pandas\dataset\titanic.csv')
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S

In [17]:
name=df['Name']

In [18]:
#lower/upper/capitalize/title
name.str.lower()
name.str.capitalize()
name.str.title()

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [19]:
#len
name[name.str.len()==82].values[0]

'Penasco y Castellana, Mrs. Victor de Satode (Maria Josefa Perez de Soto y Vallejo)'

In [20]:
#strip - remove leading and tail spaces
name.str.strip()
a="          amisbhd          sisjidj dsmc       dijidj        "
a.strip()

'amisbhd          sisjidj dsmc       dijidj'

In [21]:
#split -> get
name
# we can notice name has 3 things first name,title, last name
#make 3 col for each
name.str.split(',')
df['first_name']=name.str.split(',').str.get(0)
df.head(1)
df['Title_name']=name.str.split(',').str.get(1).str.split('.').str.get(0)
df.head(1)
df['last_name']=name.str.split(',').str.get(1).str.split('.').str.get(1)
df.head(1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,first_name,Title_name,last_name
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.25,NaN,S,Braund,Mr,Owen Harris

In [22]:
name.str.split(',').str.get(1).str.split(' ',n=2,expand=True) # expand make df

    0       1                                      2
0         Mr.                            Owen Harris
1        Mrs.  John Bradley (Florence Briggs Thayer)
2       Miss.                                  Laina
3        Mrs.          Jacques Heath (Lily May Peel)
4         Mr.                          William Henry
..  ..    ...                                    ...
886      Rev.                                 Juozas
887     Miss.                         Margaret Edith
888     Miss.               Catherine Helen "Carrie"
889       Mr.                            Karl Howell
890       Mr.                                Patrick

[891 rows x 3 columns]

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Name, Length: 891, dtype: object

In [25]:
df['Title_name'].value_counts()

Title_name
 Mr              517
 Miss            182
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Mlle              2
 Major             2
 Col               2
 the Countess      1
 Capt              1
 Ms                1
 Sir               1
 Lady              1
 Mme               1
 Don               1
 Jonkheer          1
Name: count, dtype: int64

In [31]:
#how to replace miss mlle ms as 1
#replace
df['Title_name']=df['Title_name'].str.replace('Ms','Miss')
df['Title_name']=df['Title_name'].str.replace('Mlle','Miss')

In [32]:
df['Title_name'].value_counts()

Title_name
 Mr              517
 Miss            185
 Mrs             125
 Master           40
 Dr                7
 Rev               6
 Major             2
 Col               2
 Don               1
 Mme               1
 Lady              1
 Sir               1
 Capt              1
 the Countess      1
 Jonkheer          1
Name: count, dtype: int64

In [ ]:
#filtering - startswith/endswith/isdidgit/isalpha
#passenger name starts with a
df[df['first_name'].str.startswith('A')]
df[df['first_name'].str.endswith('a')]

In [ ]:
#apply regex- regular expression
#contains
#search john -> both case
df[df['first_name'].str.contains('john',case=False)]

#find names with start and end char vowel
df[df['first_name'].str.contains('^[aeiouAEIOU].+[aeiouAEIOU]$')]
df[df['first_name'].str.contains('^[^aeiouAEIOU].+[^aeiouAEIOU]$')] #for consonant

In [54]:
df['Name'].str[:4]

0      Brau
1      Cumi
2      Heik
3      Futr
4      Alle
       ...
886    Mont
887    Grah
888    John
889    Behr
890    Dool
Name: Name, Length: 891, dtype: object